submission/bench_results/apr29_l0v2_full_decode_only_WIN/perf.log
[aiter] import [module_aiter_core] under /app/aiter-test/aiter/jit/module_aiter_core.so
`rope_parameters`'s factor field must be a float >= 1, got 40
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
Namespace(backend='vllm', base_url='http://localhost:8890', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='amd/DeepSeek-R1-0528-MXFP4', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=40, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/tmp/official_n3_152037/', result_filename='perf_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, random_prefix_len=0, use_chat_template=True, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=8)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=8192  max=8192  mean=8192.00  avg_token_mismatch=3.00  
 output_lens: min=1024  max=1024  mean=1024.00 
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 8 requests...
100%|██████████| 8/8 [00:12<00:00,  1.51s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 40/40 [01:04<00:00,  1.62s/it]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     40        
Benchmark duration (s):                  64.86     
Total input tokens:                      327680    
Total generated tokens:                  40876     
Request throughput (req/s):              0.62      
Output token throughput (tok/s):         630.23    
Total Token throughput (tok/s):          5682.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          351.71    
Median TTFT (ms):                        287.63    
P99 TTFT (ms):                           1112.79   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.90      
Median TPOT (ms):                        5.94      
P99 TPOT (ms):                           7.52      
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.21     
Median ITL (ms):                         16.26     
P99 ITL (ms):                            53.19     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          6375.41   
Median E2EL (ms):                        6461.74   
P99 E2EL (ms):                           7970.10   
==================================================